## Объектно-ориентированное программирование

<!-- TODO: добавить информацию о темах -->

### Задание 1

1. Написать класс для работы с обыкновенными дробями. Реализовать все арифметические операции с дробями и целыми числами.

### Задание 2

1. Программа запускается с одним аргументом - именем файла. Составить частотный словарь для слов, содержащихся в файле. Сохранить отсортированный по количеству вхождений словарь в файл out.txt в формате "слово - количество\n". Исключения перехватывать и печатать сообщение об ошибке.

Примечание. Для чтения файла по словам может использоваться следующий код:

```c++
    fstream file;
    string word, filename = "file.txt";
    file.open(filename.c_str());
    while (file >> word) {
        //Do something
    }
```

2. Реализовать предыдущий пример, удалив из строк знаки пунктуации. См. \<cctype\>, std::ispunct.

### Задание 3
1. Написать программу-брутфорс. Программа перебирает все комбинации заданной длины.
2. Что-нибудь с графикой.
3. Сравнить быстродействие функций find, count, sort из \<algorithm\> и соответствующих методов для контейнеров. Сделать выводы.

Примечание. Для замера времени может использоваться следующий код:

```c++
#include <iostream>
#include <cstdlib>
#include <ctime>

using namespace std;

int main() {
	clock_t t = clock();

	size_t size = 100000;
	int *pInt = new int[size];
	for(size_t i = 0; i < size; i++)
		pInt[i] = rand();

	t = clock() - t;
	cout << "time: " << t << " miliseconds" << endl;
	cout << CLOCKS_PER_SEC << " clocks per second" << endl;
	cout << "time: " << t*1.0/CLOCKS_PER_SEC << " seconds" << endl;

	delete [] pInt;
	return 0;
}
```