
function getRandomInt(min, max) {
	return Math.floor(Math.random() * (max - min + 1)) + min;
}

var selection = 1, sequence = 2;

var themeUsageTexts = [selection,
	[selection, //economics and management
		" улучшения инвестиционного климата",
		" продвижения продукта на рынке услуг",
		" повышения квалификации рабочего персонала",
		" снижения налоговой нагрузки на индвидуального предпринимателя",
	],
	" лечения водянки",
	" захоронения ядерных отходов",
	[selection, //math
		" решения систем нелинейных уравнений второго порядка",
		" поиска нормального распределения в случайно сгенерированных данных",
		" генерации диаграммы Вороного",
	],
	[sequence,
		[selection,
			" повышения надежности ",
			" улучшения ",
			" обнаружения дефектов ",
			" исследования ",
		],
		[selection,
			"автоматизированной системы управления производством",
			"двигателей летательных аппаратов",
			"газоотоводов доменной печи",
			"алгоритма типичной унификации точек доступа и избыточности",
			"обработки сообщений контекстно-свободных грамматик"
		],
	],
]

var themeTexts = [selection,
	[sequence,
		[selection,
			"Использование",
			"Разработка",
			"Реализация",
			"Совершенствование",
			"Повышение качества",
			"Эксплуатация",
			"Основные положения",
			"Модернизация",
			"Теоретические возможности использования",
			[sequence,
				[selection, "К вопросу о ","О "],
				[selection, "разработке", "внедрении", "теории"],
			]
		],
		" %theme ",
		[selection,
			[sequence,
				[selection,
					"как средства",
					"как способа",
					"в качестве метода",
					"с целью",
					"для"
				],
				themeUsageTexts
			],
			"в симметричной криптосистеме",
			"в современной распределенной сетевой ОС",
			"в дисперсных средах",
		],
	],
	[sequence,
		[selection, "Введение в", ""],
		" %theme ",
		[selection,
			"как средство",
			"как способ",
			"как метод",
			"- перспективный метод",
			"- передовая технология",
		],
		themeUsageTexts,
	]
]
